{"id":32945,"date":"2020-06-19T18:52:28","date_gmt":"2020-06-19T18:52:28","guid":{"rendered":"https:\/\/soul-manifestation.com\/?post_type=soulreadingresults&#038;p=32945"},"modified":"2020-08-10T13:24:30","modified_gmt":"2020-08-10T13:24:30","slug":"capricorn-2-2","status":"publish","type":"soulreadingresults","link":"https:\/\/soul-manifestation.com\/?soulreadingresults=capricorn-2-2","title":{"rendered":"Capricorn"},"content":{"rendered":"","protected":false},"featured_media":0,"parent":0,"template":"","egsm__response_type":[85],"acf":{"egsr_code":"Capricorn","egsr_image":{"ID":31487,"id":31487,"title":"Sapricorn","filename":"Sapricorn.png","filesize":19797,"url":"https:\/\/soul-manifestation.com\/wp-content\/uploads\/2020\/05\/Sapricorn.png","link":"https:\/\/soul-manifestation.com\/?attachment_id=31487","alt":"","author":"2","description":"","caption":"","name":"sapricorn","status":"inherit","uploaded_to":31482,"date":"2020-05-01 13:34:38","modified":"2020-05-01 13:34:38","menu_order":0,"mime_type":"image\/png","type":"image","subtype":"png","icon":"https:\/\/soul-manifestation.com\/wp-includes\/images\/media\/default.png","width":216,"height":207,"sizes":{"thumbnail":"https:\/\/soul-manifestation.com\/wp-content\/uploads\/2020\/05\/Sapricorn-150x150.png","thumbnail-width":150,"thumbnail-height":150,"medium":"https:\/\/soul-manifestation.com\/wp-content\/uploads\/2020\/05\/Sapricorn.png","medium-width":216,"medium-height":207,"medium_large":"https:\/\/soul-manifestation.com\/wp-content\/uploads\/2020\/05\/Sapricorn.png","medium_large-width":216,"medium_large-height":207,"large":"https:\/\/soul-manifestation.com\/wp-content\/uploads\/2020\/05\/Sapricorn.png","large-width":216,"large-height":207,"1536x1536":"https:\/\/soul-manifestation.com\/wp-content\/uploads\/2020\/05\/Sapricorn.png","1536x1536-width":216,"1536x1536-height":207,"2048x2048":"https:\/\/soul-manifestation.com\/wp-content\/uploads\/2020\/05\/Sapricorn.png","2048x2048-width":216,"2048x2048-height":207}},"egsr_quicktip":"YOUR POWER IS CLEAR, BUT MAY SOMETIMES BE MISDIRECTED","egsr_step1_title":"POWERFUL SOUL","egsr_step1_descr":"<p><strong>YOUR POWER IS CLEAR, BUT MAY SOMETIMES BE MISDIRECTED<\/strong><\/p>\n<p><strong>{FIRSTNAME}<\/strong>, I sense your soul is often misunderstood, with its sensitive, emotional center contained in a strong outer shield.<\/p>\n<p>Others may think you’re pretty tough... all the way through to your core.<\/p>\n<p>And they may even be intimidated by your stern exterior… but I can tune into the truth… you’re just not one to wear your heart on your sleeve. <\/p>\n<p>For this reason you may let issues fester, before you finally come out and say what’s on your mind.<\/p>\n<p>Your soul tends to put focus instead on directing energy to other things… <\/p>\n<p>I’m sensing that you probably have a very enviable work ethic.<\/p>\n<p>And you are forever climbing the mountain of your ambitions.<\/p>\n<p>Something you’re likely to agree with is that you don’t like to do work that feels below your capabilities… always wanting to take on more challenging tasks to feel satisfied.<\/p>\n<p>Your soul adores order… and feels balanced when everything in your world is safely where it needs to be.<\/p>\n<p>Powerful souls take their work extremely seriously and can feel incredibly hurt when their hard work isn’t recognized… <\/p>\n<p>This is a place where you can be held back… putting the opinions of the people closest to you on too high of a pedestal… and where negative energy can grow…<\/p>\n<p>I intuitively feel that you’ve always been incredibly hard working, putting your whole soul into a project until it‘s complete. <\/p>\n<p>But often you aren’t fully rewarded for the amount of work you put into everything...<\/p>\n<p>I also sense that you are at a crossroads in your life regarding moving toward truly being rewarded for your years of investment in your future.<\/p>\n<p>From my reading today I feel that an additional “Energy Reading” is necessary to find out exactly what’s been holding you back from achieving that all these years…<\/p>\n","egsr_step2_title":"LOW VIBRATION","egsr_step2_descr":"<p>Sometimes We Just Can’t Control Everything… Allow The Universe To Do Some Of The Work...<\/p>\n<p>Your energy is powerful and your soul’s biggest strength, though it can sometimes be its biggest weakness too…<\/p>\n<p>Tell me something <strong>{FIRSTNAME}<\/strong>…<\/p>\n<p>Do you find yourself trying to control ALL of the moving pieces of your life?<\/p>\n<p>In this modern world we live in, it’s become almost impossible to catch every rock that hurtles towards us.. bills… chores... responsibilities… <\/p>\n<p>Sometimes it’s okay to let a few of the less important things slide... in order to keep ourselves sane. <\/p>\n<p>Sometimes negative energy can grow, especially when you worry about what will happen if you let things get piled up.<\/p>\n<p>And often… the FEAR can be worse than the thing itself…<\/p>\n<p>In order to banish the negative energy and raise your vibration you must connect deeper with the spiritual side of yourself. <\/p>\n<p>Your path ahead will be foggy if you don’t make major efforts in this area.<\/p>\n<p>This is a very critical time on your path <strong>{FIRSTNAME}<\/strong>. The decisions you make at this time will have a huge impact on your life for years to come.<\/p>\n<p>And the way to know if you’re on the right path is usually found through a light reading… I’d like to give you one for free but first I need to ask you a few questions…<\/p>\n","egsr_step3_title":"STRONG","egsr_step3_descr":"<p>I believe there’s a great opportunity on the horizon for you…<\/p>\n<p>When you allow some situations in your life to unfold... without your firm control, negative energy stirred up by worries will begin to evaporate. <\/p>\n<p>Just like a pressure valve being opened and letting off steam, you’ll experience a huge sigh of relief.<\/p>\n<p>Without your firm direction, situations and people close to you... will flourish in their own way.<\/p>\n<p>Relieving you of unnecessary responsibility that your soul has carried for so long…<\/p>\n<p>Then you can direct your light to the things that really matter. <\/p>\n<p>You already have a powerful warrior soul <strong>{FIRSTNAME}<\/strong>, you can do this. <\/p>\n<p>Bravely taking a step outside your comfort zone, allowing some things to JUST BE, will begin your spiritual quest… bringing the peace and stability you need… to reach your full potential.<\/p>\n<p>You’re ready for an awakening…<\/p>\n"},"_links":{"self":[{"href":"https:\/\/soul-manifestation.com\/wp-json\/wp\/v2\/soulreadingresults\/32945"}],"collection":[{"href":"https:\/\/soul-manifestation.com\/wp-json\/wp\/v2\/soulreadingresults"}],"about":[{"href":"https:\/\/soul-manifestation.com\/wp-json\/wp\/v2\/types\/soulreadingresults"}],"wp:attachment":[{"href":"https:\/\/soul-manifestation.com\/wp-json\/wp\/v2\/media?parent=32945"}],"wp:term":[{"taxonomy":"egsm__response_type","embeddable":true,"href":"https:\/\/soul-manifestation.com\/wp-json\/wp\/v2\/egsm__response_type?post=32945"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}