{"id":32943,"date":"2020-06-19T18:43:15","date_gmt":"2020-06-19T18:43:15","guid":{"rendered":"https:\/\/soul-manifestation.com\/?post_type=soulreadingresults&#038;p=32943"},"modified":"2020-08-10T13:24:30","modified_gmt":"2020-08-10T13:24:30","slug":"cancer-2","status":"publish","type":"soulreadingresults","link":"https:\/\/soul-manifestation.com\/?soulreadingresults=cancer-2","title":{"rendered":"Cancer"},"content":{"rendered":"","protected":false},"featured_media":0,"parent":0,"template":"","egsm__response_type":[85],"acf":{"egsr_code":"Cancer","egsr_image":{"ID":31493,"id":31493,"title":"Cancer","filename":"Cancer.png","filesize":21506,"url":"https:\/\/soul-manifestation.com\/wp-content\/uploads\/2020\/05\/Cancer.png","link":"https:\/\/soul-manifestation.com\/?attachment_id=31493","alt":"","author":"2","description":"","caption":"","name":"cancer-2","status":"inherit","uploaded_to":31476,"date":"2020-05-01 13:36:44","modified":"2020-05-01 13:36:44","menu_order":0,"mime_type":"image\/png","type":"image","subtype":"png","icon":"https:\/\/soul-manifestation.com\/wp-includes\/images\/media\/default.png","width":235,"height":213,"sizes":{"thumbnail":"https:\/\/soul-manifestation.com\/wp-content\/uploads\/2020\/05\/Cancer-150x150.png","thumbnail-width":150,"thumbnail-height":150,"medium":"https:\/\/soul-manifestation.com\/wp-content\/uploads\/2020\/05\/Cancer.png","medium-width":235,"medium-height":213,"medium_large":"https:\/\/soul-manifestation.com\/wp-content\/uploads\/2020\/05\/Cancer.png","medium_large-width":235,"medium_large-height":213,"large":"https:\/\/soul-manifestation.com\/wp-content\/uploads\/2020\/05\/Cancer.png","large-width":235,"large-height":213,"1536x1536":"https:\/\/soul-manifestation.com\/wp-content\/uploads\/2020\/05\/Cancer.png","1536x1536-width":235,"1536x1536-height":213,"2048x2048":"https:\/\/soul-manifestation.com\/wp-content\/uploads\/2020\/05\/Cancer.png","2048x2048-width":235,"2048x2048-height":213}},"egsr_quicktip":"YOUR INTUITION GUIDES YOU WELL AND YOU HAVE THE POTENTIAL TO BE A HIGHLY VIBRATIONAL BEING","egsr_step1_title":"INTUITIVE SOUL","egsr_step1_descr":"<p><strong>YOUR INTUITION GUIDES YOU WELL AND YOU HAVE THE POTENTIAL TO BE A HIGHLY VIBRATIONAL BEING<\/strong><\/p>\n<p>Wow, you have one of the most interesting soul readings I’ve channelled <strong>{FIRSTNAME}<\/strong>. <\/p>\n<p>I can sense an emotionally intelligent, intuitive perhaps even psychic vibration—strongly connected to the mysteries and magic of the Universe… <\/p>\n<p>You see directly to the heart of the matter, and have probably spent your whole life helping people settle their differences… sharing your nurturing inner strength and emotional support. <\/p>\n<p>I sense you have a natural way of being in touch with your emotions… and they vary wildly from passionately ecstatic, to feeling deep sadness for a loved one in pain.<\/p>\n<p>You are probably an empath, often taking on the emotions of others around you. <\/p>\n<p>And others might take advantage of your kind and nurturing nature.<\/p>\n<p>You seem to guard your inner world well, not letting people in so lightly… and do this to protect your gentle and sensitive soul from harm. <\/p>\n<p>But your soul is incredibly loyal and you’ll wield your magic, going to the ends of the world to help someone you love.<\/p>\n<p>I can also sense a strong conviction… putting in long hours to see a project through. And if you promise someone you’ll do something, they can count on you 110%... you’ll work hard and long to make it happen...<\/p>\n<p>But despite the efforts you’ve made in your life… the fruits of your labor are yet to mature.<\/p>\n<p>This is a very critical time on your path <strong>{FIRSTNAME}<\/strong>. The decisions you make at this time will have a huge impact on your life for years to come.<\/p>\n<p>From my reading today I feel that an additional “Energy Reading” is necessary to find out exactly what’s been holding you back from the next stage in your progression…<\/p>\n","egsr_step2_title":"UNSTABLE VIBRATION","egsr_step2_descr":"<p><strong>YOU MUST TUNE INTO YOUR SPIRITUAL WISDOM TO RELEASE STUCK EMOTIONS AND RAISE YOUR VIBRATION<\/strong><\/p>\n<p><strong>{FIRSTNAME}<\/strong>, I think you’ll agree that the hardest thing for an intuitive soul to feel is… misunderstood. <\/p>\n<p>Empaths are so used to being able to take the emotional temperature of people, it’s difficult when people can’t do this with them.<\/p>\n<p>It cuts deep, and can lead to overthinking about the actions you take for others… to be careful  not to hurt them... to help where you can… <\/p>\n<p>Then the dark energies can overwhelm you… and all the unrealized expectations and disappointment can consume your beautiful soul.<\/p>\n<p>You might even be prone to depression when this happens.<\/p>\n<p><strong>{FIRSTNAME}<\/strong>, logically you understand that expecting others to know what you’re thinking isn’t going to work… people are rarely as empathic as you…<\/p>\n<p>And keeping your feelings locked up… darkens your energy, blocking your gifts to connect - to your own energy, to the frequency of others... and to the Universe.<\/p>\n<p>In order to banish the negative energy of these emotions, and raise your vibration you must connect deeper with the spiritual side of yourself. <\/p>\n<p>And I sense that you are at a crossroads in your life, <strong>{FIRSTNAME}<\/strong>. <\/p>\n<p>And the decisions you make at this time regarding connection with your spiritual nature will be key in moving you toward your destiny.<\/p>\n<p>The way to know if you’re on the right path is usually found through a light reading… I’d like to give you one for free but first I need to ask you a few questions…<\/p>\n","egsr_step3_title":"STRONG","egsr_step3_descr":"<p>I believe there’s a great opportunity on the horizon for you… <\/p>\n<p>Your gentle, creative and generous soul thrives on connection and care. And all your life your light has shone on those who need your support. <\/p>\n<p>But shadows threaten your light—when you don’t get the care and love you deserve in return.<\/p>\n<p>Speaking up is the key… learning to voice your opinions.<\/p>\n<p>And it’s not as hard as it seems. <\/p>\n<p>You’re already in touch with your emotions… have great powers of imagination, and can be very persuasive… all you have to do—is to let others know how you feel… <\/p>\n<p>And your wisdom tells you… this is much better than the conflict that comes when frustration builds up inside, spilling out into the world, dimming your beautiful light.<\/p>\n<p>When you learn to express your inner world— your frequency will raise.<\/p>\n<p>Then you’ll receive the support and love that you need… from others and the connecting energy around you.<\/p>\n"},"_links":{"self":[{"href":"https:\/\/soul-manifestation.com\/wp-json\/wp\/v2\/soulreadingresults\/32943"}],"collection":[{"href":"https:\/\/soul-manifestation.com\/wp-json\/wp\/v2\/soulreadingresults"}],"about":[{"href":"https:\/\/soul-manifestation.com\/wp-json\/wp\/v2\/types\/soulreadingresults"}],"wp:attachment":[{"href":"https:\/\/soul-manifestation.com\/wp-json\/wp\/v2\/media?parent=32943"}],"wp:term":[{"taxonomy":"egsm__response_type","embeddable":true,"href":"https:\/\/soul-manifestation.com\/wp-json\/wp\/v2\/egsm__response_type?post=32943"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}