{"id":32964,"date":"2020-06-19T19:40:22","date_gmt":"2020-06-19T19:40:22","guid":{"rendered":"https:\/\/soul-manifestation.com\/?post_type=soulreadingresults&#038;p=32964"},"modified":"2020-08-10T13:24:30","modified_gmt":"2020-08-10T13:24:30","slug":"virgo-2","status":"publish","type":"soulreadingresults","link":"https:\/\/soul-manifestation.com\/?soulreadingresults=virgo-2","title":{"rendered":"Virgo"},"content":{"rendered":"","protected":false},"featured_media":0,"parent":0,"template":"","egsm__response_type":[85],"acf":{"egsr_code":"VIRGO","egsr_image":{"ID":31491,"id":31491,"title":"Virgo","filename":"Virgo.png","filesize":18435,"url":"https:\/\/soul-manifestation.com\/wp-content\/uploads\/2020\/05\/Virgo.png","link":"https:\/\/soul-manifestation.com\/?attachment_id=31491","alt":"","author":"2","description":"","caption":"","name":"virgo-2","status":"inherit","uploaded_to":31478,"date":"2020-05-01 13:36:13","modified":"2020-05-01 13:36:13","menu_order":0,"mime_type":"image\/png","type":"image","subtype":"png","icon":"https:\/\/soul-manifestation.com\/wp-includes\/images\/media\/default.png","width":187,"height":221,"sizes":{"thumbnail":"https:\/\/soul-manifestation.com\/wp-content\/uploads\/2020\/05\/Virgo-150x150.png","thumbnail-width":150,"thumbnail-height":150,"medium":"https:\/\/soul-manifestation.com\/wp-content\/uploads\/2020\/05\/Virgo.png","medium-width":187,"medium-height":221,"medium_large":"https:\/\/soul-manifestation.com\/wp-content\/uploads\/2020\/05\/Virgo.png","medium_large-width":187,"medium_large-height":221,"large":"https:\/\/soul-manifestation.com\/wp-content\/uploads\/2020\/05\/Virgo.png","large-width":187,"large-height":221,"1536x1536":"https:\/\/soul-manifestation.com\/wp-content\/uploads\/2020\/05\/Virgo.png","1536x1536-width":187,"1536x1536-height":221,"2048x2048":"https:\/\/soul-manifestation.com\/wp-content\/uploads\/2020\/05\/Virgo.png","2048x2048-width":187,"2048x2048-height":221}},"egsr_quicktip":"YOU’RE ABLE TO ACHIEVE ANYTHING, BUT MUST USE YOUR WISDOM TO BALANCE YOUR EFFORTS","egsr_step1_title":"WISE SOUL","egsr_step1_descr":"<p><strong>YOU’RE ABLE TO ACHIEVE ANYTHING, BUT MUST USE YOUR WISDOM TO BALANCE YOUR EFFORTS<\/strong><\/p>\n<p><strong>{FIRSTNAME}<\/strong>, I’m picking up the vibrations of a wise old soul, filled with optimism, generosity and grace.<\/p>\n<p>Wow... I can feel your soul resonating with deep knowledge and wisdom, earned and gathered over many lifetimes… <\/p>\n<p>And when you’re at your best... all this wisdom allows you to see a big picture overview… whatever the situation… <\/p>\n<p>In fact... I sense a powerful ability to plan to perfection, see the talents of others, give perfect advice, work quietly and steadily… always making things happen so that life runs smoothly.<\/p>\n<p>Your wise old soul also knows... there’s no point in drama.<\/p>\n<p>You’ve probably spent your whole life avoiding pointless battles of ego, preferring to put forth more effort than your peers... <\/p>\n<p>as long as it means keeping the peace… or having a chance to be generous.<\/p>\n<p>And you probably have known for many years that you were born to complete an extremely important mission to help humanity at this critical time.<\/p>\n<p>But... I sense there’s something out of balance that is preventing you from truly living your divine purpose and achieving your dreams…<\/p>\n<p>I also can tell that you are at a crossroads in your life regarding moving toward achieving that balance now so you can fulfill your divine mission in service to humanity.<\/p>\n<p>From my reading today I feel that an additional “Energy Reading” is necessary to find out exactly what’s been holding you back from completing your mission…<\/p>\n","egsr_step2_title":"LOW VIBRATION","egsr_step2_descr":"<p><strong>IF YOU WANT YOUR EFFORTS TO MAKE A DIFFERENCE, YOU MUST ACCEPT YOUR BEST IS GOOD ENOUGH<\/strong><\/p>\n<p><strong>{FIRSTNAME}<\/strong>, I can feel your energy has a sense of great purpose… <\/p>\n<p>Its vibrant, powerful flow is connected to the Earth’s frequency… channelled to making a difference here in the world. <\/p>\n<p>And as your soul continues to learn… your energy adapts its flow to suit each new situation. <\/p>\n<p>But... there’s something blocking that flow.<\/p>\n<p>Do you find yourself being overly critical about yourself sometimes <strong>{FIRSTNAME}<\/strong>?<\/p>\n<p>When we know better… it’s common to kick ourselves for the very human mistakes we all make…<\/p>\n<p>In your quest for perfection… you can be too hard on yourself… stirring up deep-seated fears of not being “good enough” ever. <\/p>\n<p>This can pull your energy in a negative direction…  manifesting in frustration or self-loathing when things don't live up to your extremely high expectations.<\/p>\n<p>But often… the FEAR can be worse than the thing we’re fearful of.<\/p>\n<p>If you listen to the whispers of your wise soul, it knows... there’s no point in highlighting mistakes. We all learn and grow. This is the way forward.<br \/>\n“Less can be more” could be a powerful mantra for you.<\/p>\n<p>Your path to banishing negative energy… and opening up your energetic flow lies in allowing your best efforts (and the best efforts of others) to be good enough.<\/p>\n<p>This way you’ll raise your vibration, connecting deeper to your soul, which continues to grow in wisdom. <\/p>\n<p>This is a very critical time on your path, <strong>{FIRSTNAME}<\/strong>. The decisions you make at this time will have a huge impact on your life for years to come.<\/p>\n<p>And the way to know if you’re on the right path is usually found through a light reading… <\/p>\n<p>I’d like to give you one for free, but first I need to ask you a few questions…<\/p>\n","egsr_step3_title":"STRONG","egsr_step3_descr":"<p>Forever shining on the unknown… and revealing new truths.<\/p>\n<p>But the pull of darker energies caused by perfectionism can sometimes obscure your light… keeping you from achieving the things closest to your heart.<\/p>\n<p>I believe there’s an amazing opportunity on the horizon for you… <\/p>\n<p>In the next chapter of your life… your soul can truly grow... empowering you to evolve in any direction you choose.<\/p>\n<p>You’re passionate about discovery, <strong>{FIRSTNAME}<\/strong>… about uncovering the why.<\/p>\n<p>The answers you seek are right here.<\/p>\n<p>NOW is the time to let the pureness of your inner light shine... on anything you touch.<\/p>\n"},"_links":{"self":[{"href":"https:\/\/soul-manifestation.com\/wp-json\/wp\/v2\/soulreadingresults\/32964"}],"collection":[{"href":"https:\/\/soul-manifestation.com\/wp-json\/wp\/v2\/soulreadingresults"}],"about":[{"href":"https:\/\/soul-manifestation.com\/wp-json\/wp\/v2\/types\/soulreadingresults"}],"wp:attachment":[{"href":"https:\/\/soul-manifestation.com\/wp-json\/wp\/v2\/media?parent=32964"}],"wp:term":[{"taxonomy":"egsm__response_type","embeddable":true,"href":"https:\/\/soul-manifestation.com\/wp-json\/wp\/v2\/egsm__response_type?post=32964"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}