{"id":32963,"date":"2020-06-19T19:36:14","date_gmt":"2020-06-19T19:36:14","guid":{"rendered":"https:\/\/soul-manifestation.com\/?post_type=soulreadingresults&#038;p=32963"},"modified":"2020-08-10T13:24:30","modified_gmt":"2020-08-10T13:24:30","slug":"taurus-2","status":"publish","type":"soulreadingresults","link":"https:\/\/soul-manifestation.com\/?soulreadingresults=taurus-2","title":{"rendered":"Taurus"},"content":{"rendered":"","protected":false},"featured_media":0,"parent":0,"template":"","egsm__response_type":[85],"acf":{"egsr_code":"TAURUS","egsr_image":{"ID":31495,"id":31495,"title":"Taurus","filename":"Taurus.png","filesize":23501,"url":"https:\/\/soul-manifestation.com\/wp-content\/uploads\/2020\/05\/Taurus.png","link":"https:\/\/soul-manifestation.com\/?attachment_id=31495","alt":"","author":"2","description":"","caption":"","name":"taurus-2","status":"inherit","uploaded_to":31474,"date":"2020-05-01 13:37:24","modified":"2020-05-01 13:37:24","menu_order":0,"mime_type":"image\/png","type":"image","subtype":"png","icon":"https:\/\/soul-manifestation.com\/wp-includes\/images\/media\/default.png","width":214,"height":240,"sizes":{"thumbnail":"https:\/\/soul-manifestation.com\/wp-content\/uploads\/2020\/05\/Taurus-150x150.png","thumbnail-width":150,"thumbnail-height":150,"medium":"https:\/\/soul-manifestation.com\/wp-content\/uploads\/2020\/05\/Taurus.png","medium-width":214,"medium-height":240,"medium_large":"https:\/\/soul-manifestation.com\/wp-content\/uploads\/2020\/05\/Taurus.png","medium_large-width":214,"medium_large-height":240,"large":"https:\/\/soul-manifestation.com\/wp-content\/uploads\/2020\/05\/Taurus.png","large-width":214,"large-height":240,"1536x1536":"https:\/\/soul-manifestation.com\/wp-content\/uploads\/2020\/05\/Taurus.png","1536x1536-width":214,"1536x1536-height":240,"2048x2048":"https:\/\/soul-manifestation.com\/wp-content\/uploads\/2020\/05\/Taurus.png","2048x2048-width":214,"2048x2048-height":240}},"egsr_quicktip":"YOU CRAVE PASSION AND GIDDY HEIGHTS, BUT ALWAYS SEEK TO STAY GROUNDED...","egsr_step1_title":"GROUNDED SOUL","egsr_step1_descr":"<p><strong>YOU CRAVE PASSION AND GIDDY HEIGHTS, BUT ALWAYS SEEK TO STAY GROUNDED...<\/strong><\/p>\n<p>Wow! You have an interesting soul reading, <strong>{FIRSTNAME}<\/strong>!<\/p>\n<p>Grounded and sensible, yet gracefully sensuous. I feel an absolutely beautiful presence about you.<\/p>\n<p>Something tells me that you're equally at home working in the garden as you are socializing at an elegant gathering, dressed to turn every head as you enter the room.<\/p>\n<p>Your vibration shows that the world should be yours for the taking… <\/p>\n<p>But... I feel that your soul is craving growth right now...<\/p>\n<p>Do you tend to stick to a strict schedule to ground yourself? <\/p>\n<p>Grounding is the key word… to feel centered and strong, your soul food is stability.<\/p>\n<p>A grounded soul thrives on solid relationships, routine, and a cozy home base, making stable foundations to build your life on.<\/p>\n<p>You’re an incredibly resourceful person, <strong>{FIRSTNAME}<\/strong>. <\/p>\n<p>And you’re able to wield your magic wherever it’s needed… creating living spaces, nurturing relationships, or working on ideas.<\/p>\n<p>Your soul is infused with great purpose... and does everything to perfection. <\/p>\n<p>But this perfectionist streak can be an issue at times…when things don’t go quite as planned... upsetting the balance... shaking your reality.<\/p>\n<p>You’ve always been thankful of your down-to-earth nature, but have been looking out for signs on how to connect more deeply with your spiritual side…<\/p>\n<p>And I sense that you are at a crossroads in your life regarding moving toward your spiritual side now so you can fulfill your soul’s mission for this lifetime.<\/p>\n<p>From my reading today I feel that an additional “Energy Reading” is necessary to find out exactly what’s been holding you back all these years…<\/p>\n","egsr_step2_title":"LOW VIBRATION","egsr_step2_descr":"<p><strong>IF YOU WANT THE MOST OUT OF LIFE, YOU MUST LEARN TO REACH FOR THE SKY WITH YOUR FEET ON THE GROUND…<\/strong><\/p>\n<p>Your energy is thoroughly grounded <strong>{FIRSTNAME}<\/strong>, firmly rooted in your body.<\/p>\n<p>And it flows to the physical pleasures of movement, touch, taste, and connection to the natural world. <\/p>\n<p>It’s amazing how you can direct your energy, providing stability… for yourself and your loved ones… ever-nurturing, playful and loyal.<\/p>\n<p>However... your energy reading suggests that in order to grow spiritually, you must release fears surrounding loss.<\/p>\n<p>If you don’t, this can block your progress, stirring up the darker energies of possessiveness, control and even jealousy.<\/p>\n<p>It’s incredibly hard to raise your frequency when you grasp onto what you already have. This restricts growth… yours and the growth of your loved ones.<\/p>\n<p>“Hold on loosely, but don’t let go…”<\/p>\n<p>The habit of clinging will be overcome when you tune into the abundant resources within and around you. <\/p>\n<p>Then you’ll finally be able to see… there is nothing to lose and everything to gain.<\/p>\n<p>You can stay grounded... but open your life to growth....<\/p>\n<p>I also sense that this is a very critical time on your path, <strong>{FIRSTNAME}<\/strong>. <\/p>\n<p>The decisions you make at this time will have a huge impact on your life for years to come.<\/p>\n<p>And… the way to know if you’re on the right path is usually found through a light reading… <\/p>\n<p>I’d like to give you one for free, but first I need to ask you a few questions…<\/p>\n","egsr_step3_title":"STRONG","egsr_step3_descr":"<p>I believe there’s an amazing opportunity on the horizon for you…<\/p>\n<p>Are you seeking to ground yourself through people and possessions?<\/p>\n<p>When you become thoroughly grounded in yourself, your personal energy will connect to the energy around you and your light will shine bright.<br \/>\nYou already have a love of nature. <\/p>\n<p>On a spiritual level, you are nature… deep inside you can feel this.<\/p>\n<p>When you care for your soul, with the love and compassion you show others, animals and nature, endless possibilities will appear… <\/p>\n<p>You’ll be able to jump in the directions they offer... truly embracing your creative self…<\/p>\n<p>Bringing people, pleasures, finances and possessions into your life…<\/p>\n<p>With your feet on the ground, you will be able to reach for the sky. <\/p>\n<p>When you truly set your mind to something, I can sense it will happen!<\/p>\n<p>I sense that you are ready to open the next chapter of your limitless life?<\/p>\n"},"_links":{"self":[{"href":"https:\/\/soul-manifestation.com\/wp-json\/wp\/v2\/soulreadingresults\/32963"}],"collection":[{"href":"https:\/\/soul-manifestation.com\/wp-json\/wp\/v2\/soulreadingresults"}],"about":[{"href":"https:\/\/soul-manifestation.com\/wp-json\/wp\/v2\/types\/soulreadingresults"}],"wp:attachment":[{"href":"https:\/\/soul-manifestation.com\/wp-json\/wp\/v2\/media?parent=32963"}],"wp:term":[{"taxonomy":"egsm__response_type","embeddable":true,"href":"https:\/\/soul-manifestation.com\/wp-json\/wp\/v2\/egsm__response_type?post=32963"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}